import Table from "@/shared/table/Table";

function TableSection() {
  return <Table headers={tableHeaders} rows={tableRows} />;
}

const tableHeaders = [
  "이름",
  "클래스",
  "수강회차",
  "수강 요일 & 시간",
  "수강 시작 날짜",
  "결제 상태",
  "결제일",
];

const tableRows = [
  ["김광일", "드럼", "4", "화 15:00", "26.01.27", "미납", "-"],
  ["이민수", "기타", "8", "수 18:00", "26.01.28", "완납", "26.01.28"],
  ["김민지", "드럼", "4", "월 16:00", "26.01.29", "미납", "-"],
  ["최은서", "기타", "12", "금 19:00", "26.01.30", "완납", "26.01.30"],
  ["정하늘", "드럼", "4", "목 14:00", "26.01.31", "미납", "-"],
  ["김도윤", "기타", "8", "토 11:00", "26.02.01", "완납", "-"],
  ["서연우", "드럼", "4", "화 17:00", "26.02.02", "미납", "-"],
  ["윤서준", "기타", "8", "수 20:00", "26.02.03", "완납", "26.02.03"],
  ["한유진", "드럼", "8", "금 16:00", "26.02.04", "미납", "26.02.04"],
  ["오지훈", "기타", "4", "월 18:00", "26.02.05", "완납", "-"],
];

export default TableSection;
